---
kind: property
id: P:Autodesk.Revit.DB.FabricationItemFile.Identifier
source: html/b73e91e7-5604-40c3-9548-24dd388b6a11.htm
---
# Autodesk.Revit.DB.FabricationItemFile.Identifier Property

The string identifier for the item file. This string is unique and can be used to compare whether fabrication
 item files are the same file.

## Syntax (C#)
```csharp
public string Identifier { get; }
```